//=====================================================================
//
// bulletGenerator [bulletGenerator.cpp]
// Author : 
// 
//=====================================================================

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "bulletGenerator.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** グローバル変数 *****
// 
//*********************************************************************

//=====================================================================
// 出現処理処理
//=====================================================================
void GenerateBullet(D3DXVECTOR3 start, D3DXVECTOR3 rot, float fSpeed, float fRotSpeed, int nLife, BULLETTYPE type)
{
	LPBULLET pBullet = GetBulletPtr();

	for (int nCntBullet = 0; nCntBullet < BULLET_CONST::nBulletMax; nCntBullet++, pBullet++)
	{
		if (pBullet->bUse) continue;	// 使用時スキップ

		pBullet->obj.pos = start;				// 開始位置
		pBullet->obj.rot = rot;					// 角度
		pBullet->rotMove = D3DXVECTOR3(0, fRotSpeed, 0);
		pBullet->move = Direction(rot.z) * fSpeed;	// 移動量
		pBullet->fSpeed = fSpeed;				// 速度
		pBullet->nLife = nLife;
		pBullet->nMaxLife = nLife;
		pBullet->type = type;					// 種類
		pBullet->obj.color = D3DXCOLOR_WHITE;
		pBullet->obj.bVisible = true;
		pBullet->obj.size = D3DXVECTOR3(50, 100, 0);
		pBullet->bUse = true;					// 使用済みに変更
		pBullet->obj.bInversed = (bool)(rand() % 2);	// 左右反転をランダムに設定
		break;
	}
}