//=====================================================================
// 
// effect.cppのヘッダファイル [effect.h]
// Author:
//
//=====================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_		// 二重インクルード防止のマクロ

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_EFFECT			(1024)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	float fSpeed;
	float fRotSpeed;
	float fMaxScale;
	int nMaxLife;
	float fMaxAlpha;
	D3DXCOLOR col;
}EFFECTINFO;

typedef struct
{
	BASEOBJECT obj;
	bool bUsed;
	EFFECTINFO info;
	float fAngle;
	float fScale;
	int nLife;
}EFFECT;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitEffect(void);
void UninitEffect(void);
void UpdateEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, float fSpeed, float fRotSpeed, float fAngle, float fScale, int nLife, D3DXCOLOR col);

#endif