//=====================================================================
//
// Enemy.cppのヘッダファイル [Enemy.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _Enemy_H_
#define _Enemy_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"
#include "util.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define MAX_ENEMY	(256)

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	ENEMYSTATE_NORMAL = 0,
	ENEMYSTATE_DAMAGE,
	ENEMYSTATE_MAX
}ENEMYSTATE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct ENEMY
{
	BASEOBJECT obj;
	bool bUsed;
	int nConunterState;
	int nLife;
	ENEMYSTATE state;
};

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
ENEMY* SetEnemy(D3DXVECTOR3 pos);
ENEMY* GetEnemy(void);
void DamageEnemy(ENEMY* pEnemy);
void SetEnemyState(ENEMY* pEnemy, ENEMYSTATE newState);

#endif