//=====================================================================
//
// ItemManager.cppのヘッダファイル [ItemManager.h]
// Author : 
// 
//=====================================================================
#ifndef _ItemManager_H_
#define _ItemManager_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
// --- 浮動小数の矩形指定構造体 --- //
typedef struct FLOAT_RECT
{
	FLOAT left;
	FLOAT top;
	FLOAT right;
	FLOAT bottom;
} FLOAT_RECT;

typedef FLOAT_RECT *LPFLOAT_RECT, *PFLOAT_RECT;

// --- アイテム生成の設定関連 --- //
typedef struct
{
	FLOAT_RECT rect;	// 矩形範囲
	int nUpperSpawn;	// 一度の処理で出現する最大数
	int nLowerSpawn;	// 一度の処理で出現する最小数
	int nFrameSpawn;	// 出現待機フレーム
}ITEM_GENERATE_SETTING;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void UpdateItemGenerator(void);
void SetItemGenerator(ITEM_GENERATE_SETTING igs);
void ChengeGenerateRand(float alpha = 0.6f, float beta = 0.3f, float gamma = 0.1f);
#endif