//=====================================================================
//
// enemyGenerator.cppのヘッダファイル [enemyGenerator.h]
// Author : 
// 
//=====================================================================
#ifndef _Item_H_
#define _Item_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"
#include "baseObject.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	ITEMTYPE_PROTEIN_ALPHA = 0,	// PROTEINタイプα
	ITEMTYPE_MAX
} ITEMTYPE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
// --- アイテムの情報 --- //
typedef struct Item
{
	BASEOBJECT obj;		// オブジェクト情報
	ITEMTYPE type;		// アイテムの種類
	bool bUse;			// 使用済みか
} Item;

typedef Item *LPITEM, *PITEM;

// --- アイテムに関する定数まとめ --- //
typedef struct ITEM_CONST
{
	static const int nMaxItem;			// アイテムの最大数
	static const D3DXVECTOR2 DefSize;	// 基本サイズ
	static const D3DXCOLOR DefColor;	// 基本色
}ITEM_CONST;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

LPITEM GetItemPtr(void);
#endif